In [1]:
import pandas as pd
import numpy as np

In [10]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='int32'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='int32'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='int32'))

print(s1,s2,s3)

0     3
1     2
2     3
3     4
4     2
     ..
95    4
96    2
97    3
98    4
99    4
Length: 100, dtype: int32 0     1
1     1
2     1
3     2
4     2
     ..
95    2
96    3
97    3
98    1
99    3
Length: 100, dtype: int32 0     16834
1     14872
2     10279
3     17008
4     27484
      ...
95    23247
96    18285
97    18410
98    17003
99    13641
Length: 100, dtype: int32

In [11]:
houseek = pd.concat([s1,s2,s3],axis=1)
houseek.head()

   0  1      2
0  3  1  16834
1  2  1  14872
2  3  1  10279
3  4  2  17008
4  2  2  27484

In [16]:
houseek.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
houseek = houseek.sample(frac=1).reset_index(drop=True)

houseek.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            15626
1      4       1            29518
2      1       3            14210
3      2       1            29886
4      4       1            29401

In [20]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))


bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       2
2       3
3       4
4       2
..    ...
95  23247
96  18285
97  18410
98  17003
99  13641

[300 rows x 1 columns]

len(bigcolumn)

In [21]:
300

300

In [22]:
bigcolumn.reset_index(drop=True , inplace=True)
bigcolumn

         0
0        3
1        2
2        3
3        4
4        2
..     ...
295  23247
296  18285
297  18410
298  17003
299  13641

[300 rows x 1 columns]